% -------------------------------------------------------------------------
%  先运行simulation生成合适的仿真信号，再运行demo中的相应算法测试
% -------------------------------------------------------------------------
%% ---------------------------------------------------------------
%                               Demo No.1 : HNR-gram
%--------------------------------------------------------------------------
%----------------------------------参数初始化------------------------------%
nlevel = 5;
global fs;
global N 
N = length(x);
%------------------------------------主程序--------------------------------%
[Bw,fc] = HNR_gram(x,nlevel,fs,1);
%---------------------------------滤波查看效果-----------------------------%
% 滤波器生成
if fc-Bw/2==0
    b = fir1(512,2*fc/fs,'low');
else if fc+Bw/2==fs
        b = fir1(512,2*fc/fs,'high');
    else
        b = fir1(512,2*[fc-Bw/2 fc+Bw/2]/fs);
    end
end

tempx = filtfilt(b,1,x);
hilx = abs(hilbert(tempx))-mean(abs(hilbert(tempx)));

% 最优滤波频带滤波后的时域波形
figure
plot(t,hilx);
ylabel('Amplitude');
xlabel('Frequency [Hz]');
setfontsize(14);
set(gcf,'pos',pos);

% 最优滤波频带滤波后的包络谱
figure
myfft(fs,hilx,1);
ylabel('Amplitude');
xlabel('Frequency [Hz]');
setfontsize(14);
set(gcf,'pos',pos);

%% ---------------------------------------------------------------
%                               Demo No.2 : HNR-gram
%--------------------------------------------------------------------------


