%% ---------------------------------------------------------------
%                        　  轴箱轴承动态信号仿真平台       v1.2
%
%                         西安交通大学，赵明，  01/09/2017   
% -------------------------------------------------------------------------
% 该平台结合滚动轴承监测领域最新研究成果和算法，自动生成滚动轴承的全息动态信号数据，
% 可用于算法功能测试，性能测试以及科学研究和教学培训。
% 功能特点：
% 
% 1. 参数可定制： 用户可根据自身需求，定制设备的运行转速，故障类型（包括内圈、外
%                圈、滚动体），信噪比，采样频率、采样时长等；
% 2. 多分量综合： 不仅考虑轴承背身的振动信号，而且对整个系统中的齿轮、转子的干扰
%                分量也可以充分考虑，其相对强度可灵活调整; 另外，这些分量还可以
%                用于其他算法模块测试
% 3. 可二次开发： 各信号模块高内聚低耦合，可扩展性好，容易进行二次开发。后续版本
%                可进一步对变转变载轴承振动信号进行仿真
% -------------------------------------------------------------------------

clear;
close all;
clc;
pos = [91   600   1698  392];


%% ---------------------------------------------------------------
%                          轴承转速及信号采样参数设置
% -------------------------------------------------------------------------

% 信号采样频率（Hz）
global fs;
fs = 24000;

% 内圈的瞬时转速曲线设定（RPM）
vc = 600;  % 名义运行转速（RPM）
vs = 000;  % 转速波动幅值（RPM）
ff = 0.1;  % 转速波动频率（Hz）
v  = vc+vs*sin(2*pi*ff*(0:1/fs:1)); % 转速曲线 
v  = v(:); 
t = (1:length(v))/fs;

%% ---------------------------------------------------------------
%                轴承结构参数设置（以某货运列车轴承为例）
%--------------------------------------------------------------------------

% 轴承参数设置
d = 23.775;      % 滚动体直径 Ball diameter（mm） 
D = 180;         % 滚道节径 Pitch circle diameter （mm）
fai = 9;         % 接触角 Contact angle（度）    
nb = 20;         % 滚动体的个数 Number of balls

% UI输出
disp(['-----------------------------------------']);
disp(['                轴承信息                  ']);
disp(['滚珠直径 d=',num2str(d),'mm' ]);
disp(['滚道节径 D=',num2str(D),'mm' ]);
disp(['接触角  φ=',num2str(fai),'°' ]);
disp(['滚珠个数 N=',num2str(nb) ]);
disp(['-----------------------------------------']);

% 计算归一化故障特征频率
BPFO1 = (1-d/D*cosd(fai))*nb/2;            % Ball pass frequency,outer race
BPFI1 = (1+d/D*cosd(fai))*nb/2;            % Ball pass frequency,iuter race
BSF1  = (1- (d/D*cosd(fai))^2 )*D/2/d;     % Ball spin frequency


% 计算故障特征频率
BPFO = BPFO1*mean(v)/60;            % Ball pass frequency,outer race
BPFI = BPFI1*mean(v)/60;            % Ball pass frequency,iuter race
BSF  = BSF1*mean(v)/60;             % Ball spin frequency

disp(['         故障特征频率        ']);
disp(['外圈： ',num2str(BPFO,4),' Hz' ]);
disp(['内圈： ',num2str(BPFI,4),' Hz' ]);
disp(['滚珠： ',num2str(BSF,4), ' Hz' ]);


%% ---------------------------------------------------------------
%                 轴承故障类型及共振频率设置 
%--------------------------------------------------------------------------
% 本系统可以仿真三种不同类型的故障分别为 'inner','outer','rolling';
% 也可以仿真外部的随机冲击，没有周期性  'rand_impact'
% 可以同时考虑以上两种

fault1 = 'inner';             % 故障1设置为内圈故障
fault2 = 'rand_impact';       % 故障2设置为随机冲击

% 由单自由度系统的单位脉冲响应模拟轴承故障引起的冲击信号
% 故障1的系统参数
m1 = 0.005;                % 质量 Kg
c1 = 8;                    % 阻尼 N/(m/s)
k1 = 4^2*pi*pi*20000;    % 刚度 N/m

% 故障2的系统参数
m2 = 0.005;                % 质量 Kg
c2 = 15;                   % 阻尼 N/(m/s)
k2 = 7^2*pi*pi*20000;      % 刚度 N/m


% 计算冲击的固有频率   
fc1 = (k1/m1)^0.5/2/pi;
fd1 = fc1*(1-(c1/2/m1/fc1/2/pi)^2)^0.5;
disp(['-----------------------------------------']);
disp(['              故障1共振频率                ']);
disp(['无阻尼固有频率： ',num2str(fc1),' Hz' ]);
disp(['有阻尼固有频率： ',int2str(fd1),' Hz' ]);
 
fc2 = (k2/m2)^0.5/2/pi;
fd2 = fc2*(1-(c2/2/m2/fc2/2/pi)^2)^0.5;
disp(['-----------------------------------------']);
disp(['              故障2共振频率                ']);
disp(['无阻尼固有频率： ',num2str(fc2),' Hz' ]);
disp(['有阻尼固有频率： ',int2str(fd2),' Hz' ]);

%% ---------------------------------------------------------------
%                      轴承瞬时相位计算（考虑滚动体随机滑动）
%--------------------------------------------------------------------------

% 计算内圈的理论瞬时相位（度）
phs1 =cumtrapz(v/60)/fs*360;

% 相位随机波动的方差（度）
phs_var = 0.06;
disp(['-----------------------------------------']);
disp(['          相位随机波动方差: ', num2str(phs_var),'°']);

%%%%% 生成相位偏差
% 先按照白噪声生成相位偏差
phs_tor = phs_var*randn(size(v));
% 对其滤波，形成窄带相位偏差
b=fir1(200,2*[1 mean(v)/60]/fs); 
% 去除由于滤波引起的边界效应
phs_tor=filtfilt(b,1,[zeros(1000,1);phs_tor;zeros(1000,1)]); 
phs_tor = phs_tor(1001:1000+length(v));
% 对其方差进行调整，满足给定方差要求
phs_tor = (phs_tor / std(phs_tor))*phs_var;

%%%%%  生成最终相位
phs = phs1+phs_tor;

%% ---------------------------------------------------------------
%                               信号生成部分
%--------------------------------------------------------------------------

% 1. 故障冲击信号生成
imp1 = imp_gen(fs,phs,m1,c1,k1,360/BPFI1,3,fault1);
imp2 = imp_gen(fs,phs,m2,c2,k2,360/BPFI1,10,fault2);
bearing = imp1+ imp2;

% 2. 转子信号生成
rot = 3*cos(2*pi*mean(v).*t/60+pi/3)+1.3*cos(2*pi*2*mean(v).*t/60-pi/6);
rot = rot(:);
% 3. 齿轮信号生成
K = 32;   % 齿轮齿数

% 以啮合频率和谐波为载波
carrier = 2*cos(2*pi*K*mean(v).*t/60-pi/6)+0.7*cos(2*pi*2*K*mean(v).*t/60+pi/6);

% 故障轮的特征频率为转频(Hz)
f0 = mean(v)/60 ;

% 故障轮的啮合频率
fm = f0*K;

% 故障轮参与啮合的时间
T = 1/fm;

% 首先构造方波函数，占空比为1:N-1；故障影响相邻两齿
tt = (rem(t/T,K)>10)&(rem(t/T,K)<12);

% 幅值调制函数(每一个故障啮合，出现一次转速波动)
am = 1+0.3*sin(2*pi*fm*(t.*tt)/8).^2;

gear = carrier.*am; 
gear = gear(:);

% 4. 加噪信号生成
nDb =  -0;
% sig = bearing + rot + gear;
sig = bearing;
x = noisegen(sig,nDb);
noi = x - sig;

figure
plot(t,x);
ylabel('Amplitude');
xlabel('Time [s]');
xlim([0 0.4]);
setfontsize(14);
set(gcf,'pos',pos);

figure
myfft(fs,x,1);
ylabel('Amplitude');
xlabel('Frequency [Hz]');
setfontsize(14);
set(gcf,'pos',pos);


% % 加噪前
% CCMWT(sig(1:0.4*fs),fs,5000,400,20,1);
% setfontsize(14);
% xlim([0 0.4]);
% % 加噪后
% CCMWT(x(1:0.4*fs),fs,5000,400,20,1);
% setfontsize(14);
% xlim([0 0.4]);





